# GetRebarContainerIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainer..::..GetRebarContainerIterator Method
RebarContainer Class See Also
---
Returns a Rebar Container Iterator that iterates through the Rebar Container Items.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RebarContainerIterator GetRebarContainerIterator()
```

Visual Basic
---
```text
Public Function GetRebarContainerIterator As RebarContainerIterator
```

Visual C++
---
```text
public:
RebarContainerIterator^ GetRebarContainerIterator()
```

# ### Return Value
A Rebar Container Iterator object that can be used to iterate through Rebar Container Items in the collection.
# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace